{
  "menu": {
    "projects": "Projects",
    "about": "About me",
    "contact": "Contact"
  },
  "projects": {
    "bancaDoIngresso": {
      "title": "Banca do ingresso Admin Dashboard",
      "description": "The 'Banca do Ingresso' project, is a system for manage event tickets. The admin dashboard is a web application that allows the management of events, tickets and users. The system was developed using react and typescript."
    },
    "playx1": {
      "title": "PlayX1",
      "description": "The PlayX1 is a project of a platform for betting on online games. The project was developed using ReactJS, NextJS, Typescript"
    },
    "dashboard": {
      "title": "Services Dashboard",
      "description": "Under construction..."
    }
  },
  "about": {
    "text1": "I'm <strong>Gabriel</strong>, a front-end developer dedicated to creating dynamic, clean interfaces with a focus on user experience. Currently, I work at a retail company, responsible for the development and maintenance of web/mobile applications and kiosks, using technologies such as <strong>ReactTS</strong>, <strong>Chakra UI</strong> and <strong>React Native</strong>. Previously, I played an important role in the development of the front-end of an administrative system in a large events and ticketing company, using <strong>ReactTS</strong>, <strong>Redux</strong> and <strong>Sass</strong>.",
    "text2": "One of my most significant challenges was the <strong>'Project X1'</strong>, a platform for competitive online game duels that I developed entirely. This project highlighted my ability to build robust architectures and optimize user interactions, using <strong>NextJS</strong>, <strong>Typescript</strong> and <strong>Chakra UI</strong>.",
    "text3": "My approach to development is centered on creating <strong>reusable, simple and easy to maintain</strong> code, with an emphasis on developing <strong>custom components</strong> to maximize <strong>flexibility</strong> and <strong>innovation</strong>.",
    "text4": "I am in constant professional development, seeking to improve my technical skills and contribute significantly to challenging projects, with the goal of becoming a technical leader in the future."
  },
  "playx1": {
    "text1": "The X1 project was a challenge where the main objective was to maintain a standard of <strong>simple</strong>, <strong>reusable</strong> code, and with the minimum of <strong>external libraries</strong> possible.",
    "text2": "With a <strong>clean and responsive interface</strong> we used <strong>React</strong> and <strong>Typescript</strong> to develop the project, with <strong>NextJS</strong> for server-side rendering.",
    "text3": "With the goal of making the matches more exciting, the project aims to facilitate the organization of X1 matches where players can challenge each other, have a social network experience, and track match history, in addition to the possibility of making bets.",
    "navigate": "Want to navigate?",
    "credentialsTitle": "Use the credentials below to access the project:",
    "email": "Email",
    "password": "Password",
    "buttonLabel": "Access the project",
    "github": "Access on Github"
  },
  "bancaDoIngresso": {
    "text1": "The 'Banca do Ingresso' project is a ticket management system for events. The admin dashboard is a web application that allows the management of events, tickets, products, combos, users, everything related to an event.",
    "text2": "The system was developed using <strong>React</strong> and <strong>Typescript</strong>, with the aim of facilitating event management, with a white label interface, where the client can customize the interface according to the visual identity of the event.",
    "text3": "The system has a clean and intuitive interface, with a focus on user experience, and with the possibility of performing various actions such as creating events, managing tickets, and viewing reports.",
    "navigate": "Want to navigate?",
    "github": "Access on Github"
  }
}
