{
  "menu": {
    "projects": "Projetos",
    "about": "Sobre mim",
    "contact": "Contato"
  },
  "projects": {
    "bancaDoIngresso": {
      "title": "Banca do ingresso Painel Administrativo",
      "description": "O projeto Banca do Ingresso é um sistema de gestão de ingressos para eventos. O painel administrativo é uma aplicação web que permite a gestão de eventos, ingressos e usuários. O sistema foi desenvolvido utilizando react e typescript."
    },
    "playx1": {
      "title": "PlayX1",
      "description": "O PlayX1 é o projeto de uma plataforma de apostas em jogos online. O projeto foi desenvolvido utilizando ReactJS, NextJS, Typescript"
    }
  },
  "about": {
    "text1": "Sou <strong>Gabriel</strong>, um desenvolvedor front-end dedicado em criar interfaces dinâmicas, limpas e com foco na experiências de usuário. Atualmente, trabalho em uma empresa de retail, responsável pelo desenvolvimento e manutenção de aplicações web/mobile e totem, utilizando tecnologias como <strong>ReactTS</strong>, <strong>Chakra UI</strong> e <strong>React Native</strong>. Anteriormente, desempenhei papel importante no desenvolvimento do front-end de um sistema administrativo em uma grande empresa de eventos e bilheteria, usando <strong>ReactTS</strong>, <strong>Redux</strong> e <strong>Sass</strong>.",
    "text2": "Um dos meus desafios mais significativos foi o <strong>'Projeto X1'</strong>, uma plataforma de duelos de jogos online competitivo que desenvolvi integralmente. Este projeto destacou minha habilidade em construir arquiteturas robustas e otimizar interações de usuário, utilizando <strong>NextJS</strong>, <strong>Typescript</strong> e <strong>Chakra UI</strong>.",
    "text3": "Minha abordagem ao desenvolvimento é centrada na criação de código <strong>reutilizável, simples e de fácil manutenção</strong>, com ênfase em desenvolver <strong>componentes personalizados</strong> para maximizar a <strong>flexibilidade</strong> e <strong>inovação</strong>.",
    "text4": "Estou em constante desenvolvimento profissional, buscando aprimorar minhas habilidades técnicas e contribuir significativamente para projetos desafiadores, com o objetivo de me tornar um líder técnico no futuro."
  },
  "playx1": {
    "text1": "O projeto X1 foi um desafio onde o principal objetivo era manter um padrão de código <strong>simples</strong>, <strong> reutilizavel</strong>, e com o mínimo de <strong>bibliotecas externas </strong> possível.",
    "text2": "Com uma <strong>interface limpa e responsiva</strong> utilizamos <strong>React</strong> e <strong>Typescript</strong> para desenvolver o projeto, com <strong>NextJS</strong> para a renderização do lado do servidor.",
    "text3": "Com o objetivo de tornar as partidas mais emocionantes, o projeto visa facilitar a organização de partidas de X1 onde os jogadores podem se desafiar, ter uma experiência de rede social, e acompanhar o histórico de partidas, além da possibilidade de realizar apostas.",
    "navigate": "Quer navegar?",
    "credentialsTitle": "Utilize as credenciais abaixo para acessar o projeto:",
    "email": "Email",
    "password": "Senha",
    "buttonLabel": "Acesse o projeto",
    "github": "Acesse no Github"
  }
}
